#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.igsr5_time_management_slack_auth_user_name: Refreshing state... [id=/igsr5/time_management_slack/auth_user_name]
aws_cloudwatch_log_group.prod_time_management_bolt: Refreshing state... [id=/ecs/igsr5/prod/time_management_bolt]
aws_db_option_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_ecr_repository.igsr5: Refreshing state... [id=igsr5]
aws_vpc.igsr5: Refreshing state... [id=vpc-0864c7ab6ca1d76a0]
aws_db_parameter_group.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_cloudwatch_log_group.prod_time_management_go: Refreshing state... [id=/ecs/igsr5/prod/time_management_go]
aws_ssm_parameter.igsr5_time_management_slack_app_token: Refreshing state... [id=/igsr5/time_management_slack/app_token]
aws_key_pair.igsr5_debug_server_key_pair: Refreshing state... [id=igsr5_debug_server]
aws_ssm_parameter.igsr5_time_management_slack_dsn: Refreshing state... [id=/igsr5/time_management_slack/dsn]
aws_ssm_parameter.igsr5_time_management_slack_bot_user_oauth_token: Refreshing state... [id=/igsr5/time_management_slack/bot_user_oauth_token]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-igsr5]
aws_ssm_parameter.igsr5_time_management_slack_signing_secret: Refreshing state... [id=/igsr5/time_management_slack/signing_secret]
aws_ecs_cluster.igsr5: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:cluster/igsr5]
aws_ssm_parameter.igsr5_time_management_slack_auth_user_id: Refreshing state... [id=/igsr5/time_management_slack/auth_user_id]
aws_s3_bucket.athena: Refreshing state... [id=athena-igsr5]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
aws_ecr_lifecycle_policy.igsr5: Refreshing state... [id=igsr5]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::799705073177:policy/ecs-task-execution]
aws_ecs_task_definition.igsr5_time_management_slack: Refreshing state... [id=igsr5_time_management_slack]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20211124131639569600000001]
aws_internet_gateway.igsr5: Refreshing state... [id=igw-0bccf539544601095]
aws_route_table.igsr5_public: Refreshing state... [id=rtb-0e2514394e6106643]
aws_subnet.igsr5_private_0: Refreshing state... [id=subnet-091453d20102a88ad]
module.igsr5_debug_server_sg.aws_security_group.default: Refreshing state... [id=sg-0f15df175478bf578]
module.time_management_slack_sg.aws_security_group.default: Refreshing state... [id=sg-0cde50fa76f677bf0]
aws_subnet.igsr5_public_0: Refreshing state... [id=subnet-0176f59801ec25c61]
aws_route_table.igsr5_private: Refreshing state... [id=rtb-061509f2bc59e6ed4]
aws_subnet.igsr5_private_1: Refreshing state... [id=subnet-0411fd95b0c41875f]
module.mysql_sg.aws_security_group.default: Refreshing state... [id=sg-0002d9a5dda871298]
aws_subnet.igsr5_public_1: Refreshing state... [id=subnet-0978a0caf7b26a82f]
module.igsr5_debug_server_sg_80.aws_security_group.default: Refreshing state... [id=sg-040051f19452d7214]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-083f2270afd84b519]
module.vpc_endpoint_sg.aws_security_group.default: Refreshing state... [id=sg-017d47677fcdff7a6]
module.nginx_sg.aws_security_group.default: Refreshing state... [id=sg-05d50af2b833025ec]
aws_route.igsr5_public: Refreshing state... [id=r-rtb-0e2514394e61066431080289494]
module.time_management_slack_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-280917491]
module.time_management_slack_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3983031859]
aws_route_table_association.igsr5_private_1: Refreshing state... [id=rtbassoc-0b900a3894d983faf]
aws_route_table_association.igsr5_private_0: Refreshing state... [id=rtbassoc-0d89bb588ab1575e3]
aws_db_subnet_group.igsr5: Refreshing state... [id=igsr5]
aws_route_table_association.igsr5_public_0: Refreshing state... [id=rtbassoc-07c598e12997c883b]
module.igsr5_debug_server_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4116799354]
module.igsr5_debug_server_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3862433370]
module.mysql_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4064317122]
module.mysql_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2767102]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-753097682]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1166082613]
aws_ecs_service.igsr5_time_management_slack: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:799705073177:service/igsr5/igsr5_time_management_slack]
aws_route_table_association.igsr5_public_1: Refreshing state... [id=rtbassoc-09e062f160e685898]
module.igsr5_debug_server_sg_80.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2964205250]
module.igsr5_debug_server_sg_80.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1863532090]
module.nginx_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-40824367]
module.nginx_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2680455915]
module.vpc_endpoint_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3638854328]
module.vpc_endpoint_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-4230927273]
aws_instance.igsr5_debug_server: Refreshing state... [id=i-01523047055773e58]
aws_db_instance.igsr5_sandbox: Refreshing state... [id=igsr5-sandbox]
aws_lb.igsr5: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:loadbalancer/app/igsr5/e9df5a8fcd5a55c4]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-igsr5]
aws_route53_record.igsr5_sandbox_muson: Refreshing state... [id=Z10382141794HJUVL4L9O_sandbox_muson.igsr5.com_A]
aws_route53_record.igsr5: Refreshing state... [id=Z10382141794HJUVL4L9O_igsr5.com_A]
aws_acm_certificate.igsr5: Refreshing state... [id=arn:aws:acm:ap-northeast-1:799705073177:certificate/93205524-ee35-4db3-a2ec-178c97088452]
aws_route53_record.igsr5_certificate: Refreshing state... [id=Z10382141794HJUVL4L9O__3c5d11fe36cb523dbbd728056ce3e7e9.igsr5.com._CNAME]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b]
aws_acm_certificate_validation.igsr5: Refreshing state... [id=2021-12-05 06:06:57 +0000 UTC]
aws_lb_listener_rule.igsr5_sandbox_muson: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:799705073177:listener-rule/app/igsr5/e9df5a8fcd5a55c4/116a88c60b6c915b/5428e8687e4ec6b6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_db_instance.igsr5_sandbox has changed
  ~ resource "aws_db_instance" "igsr5_sandbox" {
        id                                    = "igsr5-sandbox"
      ~ latest_restorable_time                = "2022-01-03T09:50:01Z" -> "2022-01-08T16:30:01Z"
        tags                                  = {}
        # (46 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.igsr5 will be created
  + resource "aws_cloudfront_distribution" "igsr5" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "ELB-igsr5"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "igsr5.com"
          + origin_id           = "ELB-igsr5"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:799705073177:certificate/72fa95c7-b18f-477e-b15b-e7e6fa1658de"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `push`*